Autodesk.Revit.UI.UIFabricationUtils.GetUnitsElementId(Autodesk.Revit.DB.Document)
Gets the id of the units element (object of UnitsElem) of the Revit units settings
document:
The document used to extract unit information from.
Returns:
The element id of UnitsElem object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.UI.UIFabricationUtils.GetConditionSizeDescription(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.FormatOptions)
Gets the condition description for a service button's sizing condition.
document:
The document used to extract unit information from.
button:
The fabrication service button to query.
conditionIndex:
The condition index of the fabrication service button to query.
formatOptions:
The formatting options to use to format size text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.UI.UIFabricationUtils.RouteAndFillPartBrowserOnMouseLeave(Autodesk.Revit.DB.Document)
The mouse leaves the fabrication route and fill part browser.
document:
The document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.RouteAndFillPartBrowserOnPartTypeChanged(Autodesk.Revit.DB.Document,System.Int32,System.Int32,System.Int32)
The fabrication route and fill part types are changed from the fabrication part browser, so the available solutions are needed to updated.
doc:
The document.
requiredTypeId:
The fabrication part type id that must be included in the route and fill solutions.If the id is invalid, it will be ignored.
optionalTypeId:
The fabrication part type id that may or mat not be included from the route and fill solutions. If the id is invalid, will be ignored.
selectedTypeId:
The fabrication part type id that is currently selected in the Fabrication Part Browser.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.RebuildLoadedDatabase(Autodesk.Revit.DB.Document)
we need the for fabrication setting form when user clicked sync with source and cancel the form. when the internal rebuildLoadedDatabase is not called
because transaction was rolled back, but we need the reload the workspace
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.IsFabConfigConnectedToSource(Autodesk.Revit.DB.Document)
checks if the fabrication is connected to source
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.IsAllowedToPlacePart(Autodesk.Revit.DB.Document)
Checks if placing part is allowed or not.
For example, placing part is not allowed if the document is not allowed to change.
doc:
The document.
Returns:
True if placing part is allowed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.PlaceFabricationPart(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton)
Call to place a fabrication part.
serviceButton:
The Fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentException:
checks the service id, tab index and button index and makes sure they are valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorAwayColor(Autodesk.Revit.DB.Color)
Sets the color of the open connector indicator in away direction
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorTowardsColor(Autodesk.Revit.DB.Color)
Sets the color of the open connector indicator in towards direction
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorPlanColor(Autodesk.Revit.DB.Color)
Sets the color of the open connector indicator in plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017